# IdeaStatiCa.RcsApi.Model.Stirrup

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Geometry** | **PolyLine2D** |  | [optional]
**Diameter** | **double** |  | [optional]
**Material** | **ReferenceElement** |  | [optional]
**AnchorageLenght** | **double** |  | [optional]
**DiameterOfMandrel** | **double** |  | [optional]
**IsClosed** | **bool** |  | [optional]
**Distance** | **double** |  | [optional]
**ShearCheck** | **bool** |  | [optional]
**TorsionCheck** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)